/* automatically generated by rust-bindgen 0.72.1 */

pub const MPV_ENABLE_DEPRECATED: u32 = 1;
pub type wchar_t = ::std::os::raw::c_ushort;
pub type max_align_t = f64;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
unsafe extern "C" {
    #[doc = " Return the MPV_CLIENT_API_VERSION the mpv source has been compiled with."]
    pub fn mpv_client_api_version() -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_handle {
    _unused: [u8; 0],
}
#[doc = " No error happened (used to signal successful operation).\n Keep in mind that many API functions returning error codes can also\n return positive values, which also indicate success. API users can\n hardcode the fact that \">= 0\" means success."]
pub const mpv_error_MPV_ERROR_SUCCESS: mpv_error = 0;

#[doc = " The type is mpv_node.\n\n For reading, you usually would pass a pointer to a stack-allocated\n mpv_node value to mpv, and when you're done you call\n mpv_free_node_contents(&node).\n You're expected not to write to the data - if you have to, copy it\n first (which you have to do manually).\n\n For writing, you construct your own mpv_node, and pass a pointer to the\n API. The API will never write to your data (and copy it if needed), so\n you're free to use any form of allocation or memory management you like.\n\n Warning: when reading, always check the mpv_node.format member. For\n          example, properties might change their type in future versions\n          of mpv, or sometimes even during runtime.\n\n Example for reading:\n\n     mpv_node result;\n     if (mpv_get_property(ctx, \"property\", MPV_FORMAT_NODE, &result) < 0)\n         goto error;\n     printf(\"format=%d\\n\", (int)result.format);\n     mpv_free_node_contents(&result).\n\n Example for writing:\n\n     mpv_node value;\n     value.format = MPV_FORMAT_STRING;\n     value.u.string = \"hello\";\n     mpv_set_property(ctx, \"property\", MPV_FORMAT_NODE, &value);"]
pub const mpv_format_MPV_FORMAT_NODE: mpv_format = 6;
#[doc = " Used with mpv_node only. Can usually not be used directly."]
pub const mpv_format_MPV_FORMAT_NODE_ARRAY: mpv_format = 7;
#[doc = " See MPV_FORMAT_NODE_ARRAY."]
pub const mpv_format_MPV_FORMAT_NODE_MAP: mpv_format = 8;
#[doc = " A raw, untyped byte array. Only used only with mpv_node, and only in\n some very specific situations. (Some commands use it.)"]
pub const mpv_format_MPV_FORMAT_BYTE_ARRAY: mpv_format = 9;
#[doc = " Data format for options and properties. The API functions to get/set\n properties and options support multiple formats, and this enum describes\n them."]
pub type mpv_format = ::std::os::raw::c_uint;
#[doc = " Generic data storage.\n\n If mpv writes this struct (e.g. via mpv_get_property()), you must not change\n the data. In some cases (mpv_get_property()), you have to free it with\n mpv_free_node_contents(). If you fill this struct yourself, you're also\n responsible for freeing it, and you must not call mpv_free_node_contents()."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mpv_node {
    pub u: mpv_node__bindgen_ty_1,
    #[doc = " Type of the data stored in this struct. This value rules what members in\n the given union can be accessed. The following formats are currently\n defined to be allowed in mpv_node:\n\n  MPV_FORMAT_STRING       (u.string)\n  MPV_FORMAT_FLAG         (u.flag)\n  MPV_FORMAT_INT64        (u.int64)\n  MPV_FORMAT_DOUBLE       (u.double_)\n  MPV_FORMAT_NODE_ARRAY   (u.list)\n  MPV_FORMAT_NODE_MAP     (u.list)\n  MPV_FORMAT_BYTE_ARRAY   (u.ba)\n  MPV_FORMAT_NONE         (no member)\n\n If you encounter a value you don't know, you must not make any\n assumptions about the contents of union u."]
    pub format: mpv_format,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mpv_node__bindgen_ty_1 {
    pub string: *mut ::std::os::raw::c_char,
    #[doc = " valid if format==MPV_FORMAT_STRING"]
    pub flag: ::std::os::raw::c_int,
    #[doc = " valid if format==MPV_FORMAT_FLAG"]
    pub int64: i64,
    #[doc = " valid if format==MPV_FORMAT_INT64"]
    pub double_: f64,
    #[doc = " valid if format==MPV_FORMAT_DOUBLE */\n/**\n valid if format==MPV_FORMAT_NODE_ARRAY\n    or if format==MPV_FORMAT_NODE_MAP"]
    pub list: *mut mpv_node_list,
    #[doc = " valid if format==MPV_FORMAT_BYTE_ARRAY"]
    pub ba: *mut mpv_byte_array,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_node__bindgen_ty_1"][::std::mem::size_of::<mpv_node__bindgen_ty_1>() - 8usize];
    ["Alignment of mpv_node__bindgen_ty_1"][::std::mem::align_of::<mpv_node__bindgen_ty_1>() - 8usize];
    ["Offset of field: mpv_node__bindgen_ty_1::string"]
        [::std::mem::offset_of!(mpv_node__bindgen_ty_1, string) - 0usize];
    ["Offset of field: mpv_node__bindgen_ty_1::flag"][::std::mem::offset_of!(mpv_node__bindgen_ty_1, flag) - 0usize];
    ["Offset of field: mpv_node__bindgen_ty_1::int64"][::std::mem::offset_of!(mpv_node__bindgen_ty_1, int64) - 0usize];
    ["Offset of field: mpv_node__bindgen_ty_1::double_"]
        [::std::mem::offset_of!(mpv_node__bindgen_ty_1, double_) - 0usize];
    ["Offset of field: mpv_node__bindgen_ty_1::list"][::std::mem::offset_of!(mpv_node__bindgen_ty_1, list) - 0usize];
    ["Offset of field: mpv_node__bindgen_ty_1::ba"][::std::mem::offset_of!(mpv_node__bindgen_ty_1, ba) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_node"][::std::mem::size_of::<mpv_node>() - 16usize];
    ["Alignment of mpv_node"][::std::mem::align_of::<mpv_node>() - 8usize];
    ["Offset of field: mpv_node::u"][::std::mem::offset_of!(mpv_node, u) - 0usize];
    ["Offset of field: mpv_node::format"][::std::mem::offset_of!(mpv_node, format) - 8usize];
};
#[doc = " (see mpv_node)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_node_list {
    #[doc = " Number of entries. Negative values are not allowed."]
    pub num: ::std::os::raw::c_int,
    #[doc = " MPV_FORMAT_NODE_ARRAY:\n  values[N] refers to value of the Nth item\n\n MPV_FORMAT_NODE_MAP:\n  values[N] refers to value of the Nth key/value pair\n\n If num > 0, values[0] to values[num-1] (inclusive) are valid.\n Otherwise, this can be NULL."]
    pub values: *mut mpv_node,
    #[doc = " MPV_FORMAT_NODE_ARRAY:\n  unused (typically NULL), access is not allowed\n\n MPV_FORMAT_NODE_MAP:\n  keys[N] refers to key of the Nth key/value pair. If num > 0, keys[0] to\n  keys[num-1] (inclusive) are valid. Otherwise, this can be NULL.\n  The keys are in random order. The only guarantee is that keys[N] belongs\n  to the value values[N]. NULL keys are not allowed."]
    pub keys: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_node_list"][::std::mem::size_of::<mpv_node_list>() - 24usize];
    ["Alignment of mpv_node_list"][::std::mem::align_of::<mpv_node_list>() - 8usize];
    ["Offset of field: mpv_node_list::num"][::std::mem::offset_of!(mpv_node_list, num) - 0usize];
    ["Offset of field: mpv_node_list::values"][::std::mem::offset_of!(mpv_node_list, values) - 8usize];
    ["Offset of field: mpv_node_list::keys"][::std::mem::offset_of!(mpv_node_list, keys) - 16usize];
};
#[doc = " (see mpv_node)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_byte_array {
    #[doc = " Pointer to the data. In what format the data is stored is up to whatever\n uses MPV_FORMAT_BYTE_ARRAY."]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " Size of the data pointed to by ptr."]
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_byte_array"][::std::mem::size_of::<mpv_byte_array>() - 16usize];
    ["Alignment of mpv_byte_array"][::std::mem::align_of::<mpv_byte_array>() - 8usize];
    ["Offset of field: mpv_byte_array::data"][::std::mem::offset_of!(mpv_byte_array, data) - 0usize];
    ["Offset of field: mpv_byte_array::size"][::std::mem::offset_of!(mpv_byte_array, size) - 8usize];
};
unsafe extern "C" {
    #[doc = " Frees any data referenced by the node. It doesn't free the node itself.\n Call this only if the mpv client API set the node. If you constructed the\n node yourself (manually), you have to free it yourself.\n\n If node->format is MPV_FORMAT_NONE, this call does nothing. Likewise, if\n the client API sets a node with this format, this function doesn't need to\n be called. (This is just a clarification that there's no danger of anything\n strange happening in these cases.)"]
    pub fn mpv_free_node_contents(node: *mut mpv_node);
}
unsafe extern "C" {
    #[doc = " Set an option. Note that you can't normally set options during runtime. It\n works in uninitialized state (see mpv_create()), and in some cases in at\n runtime.\n\n Using a format other than MPV_FORMAT_NODE is equivalent to constructing a\n mpv_node with the given format and data, and passing the mpv_node to this\n function.\n\n Note: this is semi-deprecated. For most purposes, this is not needed anymore.\n       Starting with mpv version 0.21.0 (version 1.23) most options can be set\n       with mpv_set_property() (and related functions), and even before\n       mpv_initialize(). In some obscure corner cases, using this function\n       to set options might still be required (see\n       \"Inconsistencies between options and properties\" in the manpage). Once\n       these are resolved, the option setting functions might be fully\n       deprecated.\n\n @param name Option name. This is the same as on the mpv command line, but\n             without the leading \"--\".\n @param format see enum mpv_format.\n @param[in] data Option value (according to the format).\n @return error code"]
    pub fn mpv_set_option(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Convenience function to set an option to a string value. This is like\n calling mpv_set_option() with MPV_FORMAT_STRING.\n\n @return error code"]
    pub fn mpv_set_option_string(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Send a command to the player. Commands are the same as those used in\n input.conf, except that this function takes parameters in a pre-split\n form.\n\n The commands and their parameters are documented in input.rst.\n\n Does not use OSD and string expansion by default (unlike mpv_command_string()\n and input.conf).\n\n @param[in] args NULL-terminated list of strings. Usually, the first item\n                 is the command, and the following items are arguments.\n @return error code"]
    pub fn mpv_command(ctx: *mut mpv_handle, args: *mut *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Same as mpv_command(), but allows passing structured data in any format.\n In particular, calling mpv_command() is exactly like calling\n mpv_command_node() with the format set to MPV_FORMAT_NODE_ARRAY, and\n every arg passed in order as MPV_FORMAT_STRING.\n\n Does not use OSD and string expansion by default.\n\n The args argument can have one of the following formats:\n\n MPV_FORMAT_NODE_ARRAY:\n      Positional arguments. Each entry is an argument using an arbitrary\n      format (the format must be compatible to the used command). Usually,\n      the first item is the command name (as MPV_FORMAT_STRING). The order\n      of arguments is as documented in each command description.\n\n MPV_FORMAT_NODE_MAP:\n      Named arguments. This requires at least a special entry with the key\n      \"_name\" to be present, which must be a string, and contains the command\n      name. For compatibility, if the key \"_name\" does not exist, then the\n      entry with the key \"name\" will be used instead.\n      The special entry \"_flags\" is optional, and if present, must be an\n      array of strings, each being a command prefix to apply. All other\n      entries are interpreted as arguments. They must use the argument names\n      as documented in each command description. Some commands do not\n      support named arguments at all, and must use MPV_FORMAT_NODE_ARRAY.\n      Some commands have arguments named \"name\", and can only be used if\n      the command name is specified with key \"_name\" instead of \"name\".\n\n @param[in] args mpv_node with format set to one of the values documented\n                 above (see there for details)\n @param[out] result Optional, pass NULL if unused. If not NULL, and if the\n                    function succeeds, this is set to command-specific return\n                    data. You must call mpv_free_node_contents() to free it\n                    (again, only if the command actually succeeds).\n                    Not many commands actually use this at all.\n @return error code (the result parameter is not set on error)"]
    pub fn mpv_command_node(ctx: *mut mpv_handle, args: *mut mpv_node, result: *mut mpv_node) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " This is essentially identical to mpv_command() but it also returns a result.\n\n Does not use OSD and string expansion by default.\n\n @param[in] args NULL-terminated list of strings. Usually, the first item\n                 is the command, and the following items are arguments.\n @param[out] result Optional, pass NULL if unused. If not NULL, and if the\n                    function succeeds, this is set to command-specific return\n                    data. You must call mpv_free_node_contents() to free it\n                    (again, only if the command actually succeeds).\n                    Not many commands actually use this at all.\n @return error code (the result parameter is not set on error)"]
    pub fn mpv_command_ret(
        ctx: *mut mpv_handle,
        args: *mut *const ::std::os::raw::c_char,
        result: *mut mpv_node,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Same as mpv_command, but use input.conf parsing for splitting arguments.\n This is slightly simpler, but also more error prone, since arguments may\n need quoting/escaping.\n\n This also has OSD and string expansion enabled by default."]
    pub fn mpv_command_string(ctx: *mut mpv_handle, args: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Same as mpv_command, but run the command asynchronously.\n\n Commands are executed asynchronously. You will receive a\n MPV_EVENT_COMMAND_REPLY event. This event will also have an\n error code set if running the command failed. For commands that\n return data, the data is put into mpv_event_command.result.\n\n The only case when you do not receive an event is when the function call\n itself fails. This happens only if parsing the command itself (or otherwise\n validating it) fails, i.e. the return code of the API call is not 0 or\n positive.\n\n Safe to be called from mpv render API threads.\n\n @param reply_userdata the value mpv_event.reply_userdata of the reply will\n                       be set to (see section about asynchronous calls)\n @param args NULL-terminated list of strings (see mpv_command())\n @return error code (if parsing or queuing the command fails)"]
    pub fn mpv_command_async(
        ctx: *mut mpv_handle,
        reply_userdata: u64,
        args: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Same as mpv_command_node(), but run it asynchronously. Basically, this\n function is to mpv_command_node() what mpv_command_async() is to\n mpv_command().\n\n See mpv_command_async() for details.\n\n Safe to be called from mpv render API threads.\n\n @param reply_userdata the value mpv_event.reply_userdata of the reply will\n                       be set to (see section about asynchronous calls)\n @param args as in mpv_command_node()\n @return error code (if parsing or queuing the command fails)"]
    pub fn mpv_command_node_async(
        ctx: *mut mpv_handle,
        reply_userdata: u64,
        args: *mut mpv_node,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Signal to all async requests with the matching ID to abort. This affects\n the following API calls:\n\n      mpv_command_async\n      mpv_command_node_async\n\n All of these functions take a reply_userdata parameter. This API function\n tells all requests with the matching reply_userdata value to try to return\n as soon as possible. If there are multiple requests with matching ID, it\n aborts all of them.\n\n This API function is mostly asynchronous itself. It will not wait until the\n command is aborted. Instead, the command will terminate as usual, but with\n some work not done. How this is signaled depends on the specific command (for\n example, the \"subprocess\" command will indicate it by \"killed_by_us\" set to\n true in the result). How long it takes also depends on the situation. The\n aborting process is completely asynchronous.\n\n Not all commands may support this functionality. In this case, this function\n will have no effect. The same is true if the request using the passed\n reply_userdata has already terminated, has not been started yet, or was\n never in use at all.\n\n You have to be careful of race conditions: the time during which the abort\n request will be effective is _after_ e.g. mpv_command_async() has returned,\n and before the command has signaled completion with MPV_EVENT_COMMAND_REPLY.\n\n @param reply_userdata ID of the request to be aborted (see above)"]
    pub fn mpv_abort_async_command(ctx: *mut mpv_handle, reply_userdata: u64);
}
unsafe extern "C" {
    #[doc = " Set a property to a given value. Properties are essentially variables which\n can be queried or set at runtime. For example, writing to the pause property\n will actually pause or unpause playback.\n\n If the format doesn't match with the internal format of the property, access\n usually will fail with MPV_ERROR_PROPERTY_FORMAT. In some cases, the data\n is automatically converted and access succeeds. For example, MPV_FORMAT_INT64\n is always converted to MPV_FORMAT_DOUBLE, and access using MPV_FORMAT_STRING\n usually invokes a string parser. The same happens when calling this function\n with MPV_FORMAT_NODE: the underlying format may be converted to another\n type if possible.\n\n Using a format other than MPV_FORMAT_NODE is equivalent to constructing a\n mpv_node with the given format and data, and passing the mpv_node to this\n function. (Before API version 1.21, this was different.)\n\n Note: starting with mpv 0.21.0 (client API version 1.23), this can be used to\n       set options in general. It even can be used before mpv_initialize()\n       has been called. If called before mpv_initialize(), setting properties\n       not backed by options will result in MPV_ERROR_PROPERTY_UNAVAILABLE.\n       In some cases, properties and options still conflict. In these cases,\n       mpv_set_property() accesses the options before mpv_initialize(), and\n       the properties after mpv_initialize(). These conflicts will be removed\n       in mpv 0.23.0. See mpv_set_option() for further remarks.\n\n @param name The property name. See input.rst for a list of properties.\n @param format see enum mpv_format.\n @param[in] data Option value.\n @return error code"]
    pub fn mpv_set_property(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Convenience function to set a property to a string value.\n\n This is like calling mpv_set_property() with MPV_FORMAT_STRING."]
    pub fn mpv_set_property_string(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Convenience function to delete a property.\n\n This is equivalent to running the command \"del [name]\".\n\n @param name The property name. See input.rst for a list of properties.\n @return error code"]
    pub fn mpv_del_property(ctx: *mut mpv_handle, name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Set a property asynchronously. You will receive the result of the operation\n as MPV_EVENT_SET_PROPERTY_REPLY event. The mpv_event.error field will contain\n the result status of the operation. Otherwise, this function is similar to\n mpv_set_property().\n\n Safe to be called from mpv render API threads.\n\n @param reply_userdata see section about asynchronous calls\n @param name The property name.\n @param format see enum mpv_format.\n @param[in] data Option value. The value will be copied by the function. It\n                 will never be modified by the client API.\n @return error code if sending the request failed"]
    pub fn mpv_set_property_async(
        ctx: *mut mpv_handle,
        reply_userdata: u64,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Read the value of the given property.\n\n If the format doesn't match with the internal format of the property, access\n usually will fail with MPV_ERROR_PROPERTY_FORMAT. In some cases, the data\n is automatically converted and access succeeds. For example, MPV_FORMAT_INT64\n is always converted to MPV_FORMAT_DOUBLE, and access using MPV_FORMAT_STRING\n usually invokes a string formatter.\n\n @param name The property name.\n @param format see enum mpv_format.\n @param[out] data Pointer to the variable holding the option value. On\n                  success, the variable will be set to a copy of the option\n                  value. For formats that require dynamic memory allocation,\n                  you can free the value with mpv_free() (strings) or\n                  mpv_free_node_contents() (MPV_FORMAT_NODE).\n @return error code"]
    pub fn mpv_get_property(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Return the value of the property with the given name as string. This is\n equivalent to mpv_get_property() with MPV_FORMAT_STRING.\n\n See MPV_FORMAT_STRING for character encoding issues.\n\n On error, NULL is returned. Use mpv_get_property() if you want fine-grained\n error reporting.\n\n @param name The property name.\n @return Property value, or NULL if the property can't be retrieved. Free\n         the string with mpv_free()."]
    pub fn mpv_get_property_string(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Return the property as \"OSD\" formatted string. This is the same as\n mpv_get_property_string, but using MPV_FORMAT_OSD_STRING.\n\n @return Property value, or NULL if the property can't be retrieved. Free\n         the string with mpv_free()."]
    pub fn mpv_get_property_osd_string(
        ctx: *mut mpv_handle,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Get a property asynchronously. You will receive the result of the operation\n as well as the property data with the MPV_EVENT_GET_PROPERTY_REPLY event.\n You should check the mpv_event.error field on the reply event.\n\n Safe to be called from mpv render API threads.\n\n @param reply_userdata see section about asynchronous calls\n @param name The property name.\n @param format see enum mpv_format.\n @return error code if sending the request failed"]
    pub fn mpv_get_property_async(
        ctx: *mut mpv_handle,
        reply_userdata: u64,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Get a notification whenever the given property changes. You will receive\n updates as MPV_EVENT_PROPERTY_CHANGE. Note that this is not very precise:\n for some properties, it may not send updates even if the property changed.\n This depends on the property, and it's a valid feature request to ask for\n better update handling of a specific property. (For some properties, like\n ``clock``, which shows the wall clock, this mechanism doesn't make too\n much sense anyway.)\n\n Property changes are coalesced: the change events are returned only once the\n event queue becomes empty (e.g. mpv_wait_event() would block or return\n MPV_EVENT_NONE), and then only one event per changed property is returned.\n\n You always get an initial change notification. This is meant to initialize\n the user's state to the current value of the property.\n\n Normally, change events are sent only if the property value changes according\n to the requested format. mpv_event_property will contain the property value\n as data member.\n\n Warning: if a property is unavailable or retrieving it caused an error,\n          MPV_FORMAT_NONE will be set in mpv_event_property, even if the\n          format parameter was set to a different value. In this case, the\n          mpv_event_property.data field is invalid.\n\n If the property is observed with the format parameter set to MPV_FORMAT_NONE,\n you get low-level notifications whether the property _may_ have changed, and\n the data member in mpv_event_property will be unset. With this mode, you\n will have to determine yourself whether the property really changed. On the\n other hand, this mechanism can be faster and uses less resources.\n\n Observing a property that doesn't exist is allowed. (Although it may still\n cause some sporadic change events.)\n\n Keep in mind that you will get change notifications even if you change a\n property yourself. Try to avoid endless feedback loops, which could happen\n if you react to the change notifications triggered by your own change.\n\n Only the mpv_handle on which this was called will receive the property\n change events, or can unobserve them.\n\n Safe to be called from mpv render API threads.\n\n @param reply_userdata This will be used for the mpv_event.reply_userdata\n                       field for the received MPV_EVENT_PROPERTY_CHANGE\n                       events. (Also see section about asynchronous calls,\n                       although this function is somewhat different from\n                       actual asynchronous calls.)\n                       If you have no use for this, pass 0.\n                       Also see mpv_unobserve_property().\n @param name The property name.\n @param format see enum mpv_format. Can be MPV_FORMAT_NONE to omit values\n               from the change events.\n @return error code (usually fails only on OOM or unsupported format)"]
    pub fn mpv_observe_property(
        mpv: *mut mpv_handle,
        reply_userdata: u64,
        name: *const ::std::os::raw::c_char,
        format: mpv_format,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Undo mpv_observe_property(). This will remove all observed properties for\n which the given number was passed as reply_userdata to mpv_observe_property.\n\n Safe to be called from mpv render API threads.\n\n @param registered_reply_userdata ID that was passed to mpv_observe_property\n @return negative value is an error code, >=0 is number of removed properties\n         on success (includes the case when 0 were removed)"]
    pub fn mpv_unobserve_property(mpv: *mut mpv_handle, registered_reply_userdata: u64) -> ::std::os::raw::c_int;
}
#[doc = " Nothing happened. Happens on timeouts or sporadic wakeups."]
pub const mpv_event_id_MPV_EVENT_NONE: mpv_event_id = 0;
#[doc = " Happens when the player quits. The player enters a state where it tries\n to disconnect all clients. Most requests to the player will fail, and\n the client should react to this and quit with mpv_destroy() as soon as\n possible."]
pub const mpv_event_id_MPV_EVENT_SHUTDOWN: mpv_event_id = 1;
#[doc = " See mpv_request_log_messages()."]
pub const mpv_event_id_MPV_EVENT_LOG_MESSAGE: mpv_event_id = 2;
#[doc = " Reply to a mpv_get_property_async() request.\n See also mpv_event and mpv_event_property."]
pub const mpv_event_id_MPV_EVENT_GET_PROPERTY_REPLY: mpv_event_id = 3;
#[doc = " Reply to a mpv_set_property_async() request.\n (Unlike MPV_EVENT_GET_PROPERTY, mpv_event_property is not used.)"]
pub const mpv_event_id_MPV_EVENT_SET_PROPERTY_REPLY: mpv_event_id = 4;
#[doc = " Reply to a mpv_command_async() or mpv_command_node_async() request.\n See also mpv_event and mpv_event_command."]
pub const mpv_event_id_MPV_EVENT_COMMAND_REPLY: mpv_event_id = 5;
#[doc = " Notification before playback start of a file (before the file is loaded).\n See also mpv_event and mpv_event_start_file."]
pub const mpv_event_id_MPV_EVENT_START_FILE: mpv_event_id = 6;
#[doc = " Notification after playback end (after the file was unloaded).\n See also mpv_event and mpv_event_end_file."]
pub const mpv_event_id_MPV_EVENT_END_FILE: mpv_event_id = 7;
#[doc = " Notification when the file has been loaded (headers were read etc.), and\n decoding starts."]
pub const mpv_event_id_MPV_EVENT_FILE_LOADED: mpv_event_id = 8;
#[doc = " Idle mode was entered. In this mode, no file is played, and the playback\n core waits for new commands. (The command line player normally quits\n instead of entering idle mode, unless --idle was specified. If mpv\n was started with mpv_create(), idle mode is enabled by default.)\n\n @deprecated This is equivalent to using mpv_observe_property() on the\n             \"idle-active\" property. The event is redundant, and might be\n             removed in the far future. As a further warning, this event\n             is not necessarily sent at the right point anymore (at the\n             start of the program), while the property behaves correctly."]
pub const mpv_event_id_MPV_EVENT_IDLE: mpv_event_id = 11;
#[doc = " Sent every time after a video frame is displayed. Note that currently,\n this will be sent in lower frequency if there is no video, or playback\n is paused - but that will be removed in the future, and it will be\n restricted to video frames only.\n\n @deprecated Use mpv_observe_property() with relevant properties instead\n             (such as \"playback-time\")."]
pub const mpv_event_id_MPV_EVENT_TICK: mpv_event_id = 14;
#[doc = " Triggered by the script-message input command. The command uses the\n first argument of the command as client name (see mpv_client_name()) to\n dispatch the message, and passes along all arguments starting from the\n second argument as strings.\n See also mpv_event and mpv_event_client_message."]
pub const mpv_event_id_MPV_EVENT_CLIENT_MESSAGE: mpv_event_id = 16;
#[doc = " Happens after video changed in some way. This can happen on resolution\n changes, pixel format changes, or video filter changes. The event is\n sent after the video filters and the VO are reconfigured. Applications\n embedding a mpv window should listen to this event in order to resize\n the window if needed.\n Note that this event can happen sporadically, and you should check\n yourself whether the video parameters really changed before doing\n something expensive."]
pub const mpv_event_id_MPV_EVENT_VIDEO_RECONFIG: mpv_event_id = 17;
#[doc = " Similar to MPV_EVENT_VIDEO_RECONFIG. This is relatively uninteresting,\n because there is no such thing as audio output embedding."]
pub const mpv_event_id_MPV_EVENT_AUDIO_RECONFIG: mpv_event_id = 18;
#[doc = " Happens when a seek was initiated. Playback stops. Usually it will\n resume with MPV_EVENT_PLAYBACK_RESTART as soon as the seek is finished."]
pub const mpv_event_id_MPV_EVENT_SEEK: mpv_event_id = 20;
#[doc = " There was a discontinuity of some sort (like a seek), and playback\n was reinitialized. Usually happens on start of playback and after\n seeking. The main purpose is allowing the client to detect when a seek\n request is finished."]
pub const mpv_event_id_MPV_EVENT_PLAYBACK_RESTART: mpv_event_id = 21;
#[doc = " Event sent due to mpv_observe_property().\n See also mpv_event and mpv_event_property."]
pub const mpv_event_id_MPV_EVENT_PROPERTY_CHANGE: mpv_event_id = 22;
#[doc = " Happens if the internal per-mpv_handle ringbuffer overflows, and at\n least 1 event had to be dropped. This can happen if the client doesn't\n read the event queue quickly enough with mpv_wait_event(), or if the\n client makes a very large number of asynchronous calls at once.\n\n Event delivery will continue normally once this event was returned\n (this forces the client to empty the queue completely)."]
pub const mpv_event_id_MPV_EVENT_QUEUE_OVERFLOW: mpv_event_id = 24;
#[doc = " Triggered if a hook handler was registered with mpv_hook_add(), and the\n hook is invoked. If you receive this, you must handle it, and continue\n the hook with mpv_hook_continue().\n See also mpv_event and mpv_event_hook."]
pub const mpv_event_id_MPV_EVENT_HOOK: mpv_event_id = 25;
pub type mpv_event_id = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " Return a string describing the event. For unknown events, NULL is returned.\n\n Note that all events actually returned by the API will also yield a non-NULL\n string with this function.\n\n @param event event ID, see see enum mpv_event_id\n @return A static string giving a short symbolic name of the event. It\n         consists of lower-case alphanumeric characters and can include \"-\"\n         characters. This string is suitable for use in e.g. scripting\n         interfaces.\n         The string is completely static, i.e. doesn't need to be deallocated,\n         and is valid forever."]
    pub fn mpv_event_name(event: mpv_event_id) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_property {
    #[doc = " Name of the property."]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " Format of the data field in the same struct. See enum mpv_format.\n This is always the same format as the requested format, except when\n the property could not be retrieved (unavailable, or an error happened),\n in which case the format is MPV_FORMAT_NONE."]
    pub format: mpv_format,
    #[doc = " Received property value. Depends on the format. This is like the\n pointer argument passed to mpv_get_property().\n\n For example, for MPV_FORMAT_STRING you get the string with:\n\n    char *value = *(char **)(event_property->data);\n\n Note that this is set to NULL if retrieving the property failed (the\n format will be MPV_FORMAT_NONE)."]
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_property"][::std::mem::size_of::<mpv_event_property>() - 24usize];
    ["Alignment of mpv_event_property"][::std::mem::align_of::<mpv_event_property>() - 8usize];
    ["Offset of field: mpv_event_property::name"][::std::mem::offset_of!(mpv_event_property, name) - 0usize];
    ["Offset of field: mpv_event_property::format"][::std::mem::offset_of!(mpv_event_property, format) - 8usize];
    ["Offset of field: mpv_event_property::data"][::std::mem::offset_of!(mpv_event_property, data) - 16usize];
};
pub const mpv_log_level_MPV_LOG_LEVEL_NONE: mpv_log_level = 0;
#[doc = " \"no\"    - disable absolutely all messages"]
pub const mpv_log_level_MPV_LOG_LEVEL_FATAL: mpv_log_level = 10;
#[doc = " \"fatal\" - critical/aborting errors"]
pub const mpv_log_level_MPV_LOG_LEVEL_ERROR: mpv_log_level = 20;
#[doc = " \"error\" - simple errors"]
pub const mpv_log_level_MPV_LOG_LEVEL_WARN: mpv_log_level = 30;
#[doc = " \"warn\"  - possible problems"]
pub const mpv_log_level_MPV_LOG_LEVEL_INFO: mpv_log_level = 40;
#[doc = " \"info\"  - informational message"]
pub const mpv_log_level_MPV_LOG_LEVEL_V: mpv_log_level = 50;
#[doc = " \"v\"     - noisy informational message"]
pub const mpv_log_level_MPV_LOG_LEVEL_DEBUG: mpv_log_level = 60;
#[doc = " \"debug\" - very noisy technical information"]
pub const mpv_log_level_MPV_LOG_LEVEL_TRACE: mpv_log_level = 70;
#[doc = " Numeric log levels. The lower the number, the more important the message is.\n MPV_LOG_LEVEL_NONE is never used when receiving messages. The string in\n the comment after the value is the name of the log level as used for the\n mpv_request_log_messages() function.\n Unused numeric values are unused, but reserved for future use."]
pub type mpv_log_level = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_log_message {
    #[doc = " The module prefix, identifies the sender of the message. As a special\n case, if the message buffer overflows, this will be set to the string\n \"overflow\" (which doesn't appear as prefix otherwise), and the text\n field will contain an informative message."]
    pub prefix: *const ::std::os::raw::c_char,
    #[doc = " The log level as string. See mpv_request_log_messages() for possible\n values. The level \"no\" is never used here."]
    pub level: *const ::std::os::raw::c_char,
    #[doc = " The log message. It consists of 1 line of text, and is terminated with\n a newline character. (Before API version 1.6, it could contain multiple\n or partial lines.)"]
    pub text: *const ::std::os::raw::c_char,
    #[doc = " The same contents as the level field, but as a numeric ID.\n Since API version 1.6."]
    pub log_level: mpv_log_level,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_log_message"][::std::mem::size_of::<mpv_event_log_message>() - 32usize];
    ["Alignment of mpv_event_log_message"][::std::mem::align_of::<mpv_event_log_message>() - 8usize];
    ["Offset of field: mpv_event_log_message::prefix"][::std::mem::offset_of!(mpv_event_log_message, prefix) - 0usize];
    ["Offset of field: mpv_event_log_message::level"][::std::mem::offset_of!(mpv_event_log_message, level) - 8usize];
    ["Offset of field: mpv_event_log_message::text"][::std::mem::offset_of!(mpv_event_log_message, text) - 16usize];
    ["Offset of field: mpv_event_log_message::log_level"]
        [::std::mem::offset_of!(mpv_event_log_message, log_level) - 24usize];
};
#[doc = " The end of file was reached. Sometimes this may also happen on\n incomplete or corrupted files, or if the network connection was\n interrupted when playing a remote file. It also happens if the\n playback range was restricted with --end or --frames or similar."]
pub const mpv_end_file_reason_MPV_END_FILE_REASON_EOF: mpv_end_file_reason = 0;
#[doc = " Playback was stopped by an external action (e.g. playlist controls)."]
pub const mpv_end_file_reason_MPV_END_FILE_REASON_STOP: mpv_end_file_reason = 2;
#[doc = " Playback was stopped by the quit command or player shutdown."]
pub const mpv_end_file_reason_MPV_END_FILE_REASON_QUIT: mpv_end_file_reason = 3;
#[doc = " Some kind of error happened that lead to playback abort. Does not\n necessarily happen on incomplete or broken files (in these cases, both\n MPV_END_FILE_REASON_ERROR or MPV_END_FILE_REASON_EOF are possible).\n\n mpv_event_end_file.error will be set."]
pub const mpv_end_file_reason_MPV_END_FILE_REASON_ERROR: mpv_end_file_reason = 4;
#[doc = " The file was a playlist or similar. When the playlist is read, its\n entries will be appended to the playlist after the entry of the current\n file, the entry of the current file is removed, and a MPV_EVENT_END_FILE\n event is sent with reason set to MPV_END_FILE_REASON_REDIRECT. Then\n playback continues with the playlist contents.\n Since API version 1.18."]
pub const mpv_end_file_reason_MPV_END_FILE_REASON_REDIRECT: mpv_end_file_reason = 5;
#[doc = " Since API version 1.9."]
pub type mpv_end_file_reason = ::std::os::raw::c_int;
#[doc = " Since API version 1.108."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_start_file {
    #[doc = " Playlist entry ID of the file being loaded now."]
    pub playlist_entry_id: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_start_file"][::std::mem::size_of::<mpv_event_start_file>() - 8usize];
    ["Alignment of mpv_event_start_file"][::std::mem::align_of::<mpv_event_start_file>() - 8usize];
    ["Offset of field: mpv_event_start_file::playlist_entry_id"]
        [::std::mem::offset_of!(mpv_event_start_file, playlist_entry_id) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_end_file {
    #[doc = " Corresponds to the values in enum mpv_end_file_reason.\n\n Unknown values should be treated as unknown."]
    pub reason: mpv_end_file_reason,
    #[doc = " If reason==MPV_END_FILE_REASON_ERROR, this contains a mpv error code\n (one of MPV_ERROR_...) giving an approximate reason why playback\n failed. In other cases, this field is 0 (no error).\n Since API version 1.9."]
    pub error: ::std::os::raw::c_int,
    #[doc = " Playlist entry ID of the file that was being played or attempted to be\n played. This has the same value as the playlist_entry_id field in the\n corresponding mpv_event_start_file event.\n Since API version 1.108."]
    pub playlist_entry_id: i64,
    #[doc = " If loading ended, because the playlist entry to be played was for example\n a playlist, and the current playlist entry is replaced with a number of\n other entries. This may happen at least with MPV_END_FILE_REASON_REDIRECT\n (other event types may use this for similar but different purposes in the\n future). In this case, playlist_insert_id will be set to the playlist\n entry ID of the first inserted entry, and playlist_insert_num_entries to\n the total number of inserted playlist entries. Note this in this specific\n case, the ID of the last inserted entry is playlist_insert_id+num-1.\n Beware that depending on circumstances, you may observe the new playlist\n entries before seeing the event (e.g. reading the \"playlist\" property or\n getting a property change notification before receiving the event).\n Since API version 1.108."]
    pub playlist_insert_id: i64,
    #[doc = " See playlist_insert_id. Only non-0 if playlist_insert_id is valid. Never\n negative.\n Since API version 1.108."]
    pub playlist_insert_num_entries: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_end_file"][::std::mem::size_of::<mpv_event_end_file>() - 32usize];
    ["Alignment of mpv_event_end_file"][::std::mem::align_of::<mpv_event_end_file>() - 8usize];
    ["Offset of field: mpv_event_end_file::reason"][::std::mem::offset_of!(mpv_event_end_file, reason) - 0usize];
    ["Offset of field: mpv_event_end_file::error"][::std::mem::offset_of!(mpv_event_end_file, error) - 4usize];
    ["Offset of field: mpv_event_end_file::playlist_entry_id"]
        [::std::mem::offset_of!(mpv_event_end_file, playlist_entry_id) - 8usize];
    ["Offset of field: mpv_event_end_file::playlist_insert_id"]
        [::std::mem::offset_of!(mpv_event_end_file, playlist_insert_id) - 16usize];
    ["Offset of field: mpv_event_end_file::playlist_insert_num_entries"]
        [::std::mem::offset_of!(mpv_event_end_file, playlist_insert_num_entries) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_client_message {
    #[doc = " Arbitrary arguments chosen by the sender of the message. If num_args > 0,\n you can access args[0] through args[num_args - 1] (inclusive). What\n these arguments mean is up to the sender and receiver.\n None of the valid items are NULL."]
    pub num_args: ::std::os::raw::c_int,
    pub args: *mut *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_client_message"][::std::mem::size_of::<mpv_event_client_message>() - 16usize];
    ["Alignment of mpv_event_client_message"][::std::mem::align_of::<mpv_event_client_message>() - 8usize];
    ["Offset of field: mpv_event_client_message::num_args"]
        [::std::mem::offset_of!(mpv_event_client_message, num_args) - 0usize];
    ["Offset of field: mpv_event_client_message::args"]
        [::std::mem::offset_of!(mpv_event_client_message, args) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event_hook {
    #[doc = " The hook name as passed to mpv_hook_add()."]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " Internal ID that must be passed to mpv_hook_continue()."]
    pub id: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_hook"][::std::mem::size_of::<mpv_event_hook>() - 16usize];
    ["Alignment of mpv_event_hook"][::std::mem::align_of::<mpv_event_hook>() - 8usize];
    ["Offset of field: mpv_event_hook::name"][::std::mem::offset_of!(mpv_event_hook, name) - 0usize];
    ["Offset of field: mpv_event_hook::id"][::std::mem::offset_of!(mpv_event_hook, id) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mpv_event_command {
    #[doc = " Result data of the command. Note that success/failure is signaled\n separately via mpv_event.error. This field is only for result data\n in case of success. Most commands leave it at MPV_FORMAT_NONE. Set\n to MPV_FORMAT_NONE on failure."]
    pub result: mpv_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event_command"][::std::mem::size_of::<mpv_event_command>() - 16usize];
    ["Alignment of mpv_event_command"][::std::mem::align_of::<mpv_event_command>() - 8usize];
    ["Offset of field: mpv_event_command::result"][::std::mem::offset_of!(mpv_event_command, result) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpv_event {
    #[doc = " One of mpv_event. Keep in mind that later ABI compatible releases might\n add new event types. These should be ignored by the API user."]
    pub event_id: mpv_event_id,
    #[doc = " This is mainly used for events that are replies to (asynchronous)\n requests. It contains a status code, which is >= 0 on success, or < 0\n on error (a mpv_error value). Usually, this will be set if an\n asynchronous request fails.\n Used for:\n  MPV_EVENT_GET_PROPERTY_REPLY\n  MPV_EVENT_SET_PROPERTY_REPLY\n  MPV_EVENT_COMMAND_REPLY"]
    pub error: ::std::os::raw::c_int,
    #[doc = " If the event is in reply to a request (made with this API and this\n API handle), this is set to the reply_userdata parameter of the request\n call. Otherwise, this field is 0.\n Used for:\n  MPV_EVENT_GET_PROPERTY_REPLY\n  MPV_EVENT_SET_PROPERTY_REPLY\n  MPV_EVENT_COMMAND_REPLY\n  MPV_EVENT_PROPERTY_CHANGE\n  MPV_EVENT_HOOK"]
    pub reply_userdata: u64,
    #[doc = " The meaning and contents of the data member depend on the event_id:\n  MPV_EVENT_GET_PROPERTY_REPLY:     mpv_event_property*\n  MPV_EVENT_PROPERTY_CHANGE:        mpv_event_property*\n  MPV_EVENT_LOG_MESSAGE:            mpv_event_log_message*\n  MPV_EVENT_CLIENT_MESSAGE:         mpv_event_client_message*\n  MPV_EVENT_START_FILE:             mpv_event_start_file* (since v1.108)\n  MPV_EVENT_END_FILE:               mpv_event_end_file*\n  MPV_EVENT_HOOK:                   mpv_event_hook*\n  MPV_EVENT_COMMAND_REPLY*          mpv_event_command*\n  other: NULL\n\n Note: future enhancements might add new event structs for existing or new\n       event types."]
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpv_event"][::std::mem::size_of::<mpv_event>() - 24usize];
    ["Alignment of mpv_event"][::std::mem::align_of::<mpv_event>() - 8usize];
    ["Offset of field: mpv_event::event_id"][::std::mem::offset_of!(mpv_event, event_id) - 0usize];
    ["Offset of field: mpv_event::error"][::std::mem::offset_of!(mpv_event, error) - 4usize];
    ["Offset of field: mpv_event::reply_userdata"][::std::mem::offset_of!(mpv_event, reply_userdata) - 8usize];
    ["Offset of field: mpv_event::data"][::std::mem::offset_of!(mpv_event, data) - 16usize];
};
unsafe extern "C" {
